[![Review Assignment Due Date](https://classroom.github.com/assets/deadline-readme-button-24ddc0f5d75046c5622901739e7c5dd533143b0c8e959d652212380cedb1ea36.svg)](https://classroom.github.com/a/KQDngFN1)
# Atividade 05

# ExercÃ­cios (15 pontos + ğŸ† 1 BÃ”NUS)


### Tema 1 - ğŸ§¿ Monoides

> A princÃ­pio o seu cÃ³digo nÃ£o irÃ¡ compilar! SerÃ¡ necessÃ¡rio preencher pelo menos as instÃ¢ncias pedidas, mesmo que com `undefined`s por enquanto. Aproveitamos a oportunidade para lembrar a vocÃªs que cÃ³digos que nÃ£o compilarem receberÃ£o a nota 0.

1. â˜…â˜†â˜† Considere o tipo `data Resultado = Pontuacao Int | Cola`, que representa o resultado das atividades entregues por um aluno. No final do quadrimestre, deseja-se somar a pontuaÃ§Ã£o de todas as atividades entregues. No entanto, no caso de `Cola`, toda a pontuaÃ§Ã£o obtida atÃ© o momento deve ser descartada, pois implica reprovaÃ§Ã£o automÃ¡tica. Implemente uma instÃ¢ncia de monoide para `Resultado` que modele esse comportamento.

2. â˜…â˜†â˜† Considere o tipo `data Set a = Set [a]`, que deve representar um conjunto arbitrÃ¡rio de qualquer `a`.
    **Invariante:** a lista armazenada pelo construtor `Set` deve sempre conter elementos Ãºnicos e ordenados.
    - Implemente uma instÃ¢ncia de `Show` para o set, que mostre-o conforme o seguinte exemplo: `Set [1,2,4] => "{1,2,4}"` (considere a funÃ§Ã£o `intercalate` do `Data.List`)
    - Implemente uma funÃ§Ã£o `fromList :: Ord a => [a] -> Set a` que gera um conjunto a partir de uma lista.
    - Implemente uma funÃ§Ã£o `member :: Ord a => a -> Set a -> Bool` que retorna se um elemento pertence Ã quele conjunto
    - Implemente uma funÃ§Ã£o `insert :: Ord a => a -> Set a -> Set a` que adiciona o elemento passado por parÃ¢metro no conjunto passado por parÃ¢metro
    - Implemente uma funÃ§Ã£o `delete ::  Ord a => a -> Set a -> Set a` que faz o inverso da funÃ§Ã£o acima
3. â˜…â˜…â˜† Implemente uma instÃ¢ncia de `Monoid` para `Set a`, dado que `a` seja `Ord`, utilizando a operaÃ§Ã£o de uniÃ£o de conjuntos

4. â˜…â˜…â˜† VocÃª estÃ¡ abrindo uma lanchonete diferente, pois nÃ£o existe um cardÃ¡pio fixo. VocÃª apenas fornece uma lista de ingredientes possÃ­veis, e os clientes podem combinÃ¡-los como bem entenderem. Considere os tipos `data Dieta = Vegano | Vegetariano | Tradicional`, e `data Lanche = Lanche (Set String) Int Dieta`. Dessa forma, um Lanche Ã© composto por um conjunto de ingredientes, um preÃ§o em centavos e qual o tipo de Dieta adequado para aquele lanche. Implemente uma instÃ¢ncia de monoide para `Dieta`, considerando o seguinte que duas dietas sÃ£o combinadas usando  "denominador comum", ou seja, duas dietas diferentes resultam na menos restritiva:
    - Se vocÃª colocar queijo (alimento vegetariano, mas nÃ£o vegano) em um lanche vegano, ele deixa de ser vegano
    - Mas colocar queijo em um lanche tradicional nÃ£o faz com que ele deixe de ser tradicional

5. â˜…â˜†â˜† Implemente uma instÃ¢ncia de monoide para o `Lanche`, conforme as seguintes regras para combinar dois `Lanche`s:
    - A lista de ingredientes deve ser combinada usando uniÃ£o de conjuntos (pode usar sua implementaÃ§Ã£o de `<>`)
    - O preÃ§o deve ser simplesmente somado
    - A `Dieta` deve seguir o `<>` implementado anteriormente

### Tema 2 - ğŸ¦¸â€â™‚ï¸ CÃ¡lculo Lambda

ParabÃ©ns! VocÃª foi contratado para continuar desenvolvendo uma biblioteca de CÃ¡lculo Lambda escrita na sua linguagem preferida: Haskell! Para a sua sorte (ou azar), a maior parte das funcionalidades jÃ¡ estÃ£o escritas, e estÃ£o disponÃ­veis no arquivo `Definitions.hs`. Pode ser uma boa ideia dar uma olhada no arquivo para entender como criar suas prÃ³prias funÃ§Ãµes.

O arquivo `Interpreter.hs` Ã© responsÃ¡vel por interpretar (executar) as funÃ§Ãµes escritas em cÃ¡lculo lambda. VocÃª **nÃ£o precisa** entender como ele estÃ¡ implementado, mas pode ser uma boa ideia se familiarizar com as funÃ§Ãµes na seÃ§Ã£o "LambdaÃ§Ãµes para facilitar o uso do interpretador". Abaixo, seguem alguns exemplos como usar o interpretador no `ghci`, com comentÃ¡rios deixados pelo seu antecessor antes de ele sumir misteriosamente nas proximidades uma ilha do PacÃ­fico:

```hs
> identity -- mostra a definiÃ§Ã£o da funÃ§Ã£o identidade usando os ADTs
> putStrLn $ prettyShow $ identity -- mostra a definiÃ§Ã£o da funÃ§Ã£o identidade de uma forma "bonita"
> Apply not_ true -- aplica a funÃ§Ã£o not na funÃ§Ã£o true
> Apply (Apply and_ true) false -- aplica true && false
> apply2 and_ true false -- idem acima
> run $ apply2 and_ true false -- executa o cÃ³digo, retornando a expressÃ£o lambda simplificada/reduzida
> runBool $ apply2 and_ true false -- idem acima, mas converte o resultado para um Bool nativo do Haskell (Ãºtil para inspeÃ§Ã£o)
> runInt $ apply2 add one two -- aplica a funÃ§Ã£o add em 1 e 2, executando-a e convertendo o resultado para Int nativo do Haskell
> intToChurch 7 -- converte o nÃºmero 7 para Church-encoded
> runInt $ apply2 mul (intToChurch 7) (intToChurch 6) -- resposta da vida, universo e tudo o mais
> apply2 pair one two -- (1, 2)
> runInt $ Apply fst_ $ apply2 pair one two -- fst (1, 2) ==> 1
> runInt $ apply2 yComb factorial (intToChurch 3) -- factorial 3. OBS: 4 jÃ¡ demora um pouco, 5 entÃ£o...
> runInt $ apply2 yComb fib (intToChurch 5) -- 5o numero de fibonacci
```

A Ãºnica *feature* que falta ser implementada sÃ£o as Listas. Como seu antecessor era um bom desenvolvedor que segue as boas prÃ¡ticas de TDD, ele deixou os testes prontos, mas nÃ£o hÃ¡ quase nenhuma implementaÃ§Ã£o. AlÃ©m disso, ele deixou os seguintes comentÃ¡rios:

- Uma lista (x:xs) pode ser representada pela tupla (x, xs)
- Uma lista vazia pode ser representada pelo valor false
- Logo, a lista [x] pode ser representada pela tupla (x, false), e a lista [x,y,z] pela tupla (x, (y, (z, false)))
- A implementaÃ§Ã£o do operador `null_` (com comportamento equivalente ao `null` do Haskell) jÃ¡ foi fornecida.
- O operador `nil` devolve uma lista vazia.

Implemente, usando os ADTs da biblioteca de cÃ¡lculo lambda:

6. â˜…â˜†â˜† Os operadores `nil`, `cons`, `head_` e `tail_`.
7. â˜…â˜…â˜† As funÃ§Ãµes de conversÃ£o `listOfIntToChurch` e `runListOfInt`, conforme a tipagem fornecida
8. â˜…â˜…â˜… A funÃ§Ã£o `at`, que deve funcionar como o operador `!!` em Haskell. Assuma que nunca serÃ¡ passada uma lista vazia, ou uma posiÃ§Ã£o que estÃ¡ fora dos limites da lista
9. â˜…â˜…â˜…â˜… ğŸ†**QUESTÃƒO BÃ”NUS**ğŸ† - Implemente a funÃ§Ã£o `filter_`, que deve ter o mesmo comportamento do Haskell.



### Tema 3 - Parsers pra que te quero!

Em Haskell, um Parser pode ser definido por pelo tipo `newtype Parser a = Parser {runParser :: String -> Maybe (String, a)}`. Ou seja, um *parser* Ã© simplesmente uma funÃ§Ã£o que recebe uma string e tenta gerar um `a` a partir dela. Se falhar, retorna `Nothing`. Se for bem sucedido, retorna o par `(String, a)`, cujo segundo elemento Ã© o que foi "parseado", e o primeiro Ã© a `String` que ainda resta.

Observe, por exemplo, a implementaÃ§Ã£o do parser `charP`, que pode ser configurado via parÃ¢metro para fazer o *parse* de um `char` especÃ­fico. Tente, por exemplo, fazer `runParser (charP 'b') "banana"`, e depois com outra string que nÃ£o comece com "b".

Empolgado com a ideia, vocÃª comeÃ§a a implementar outros *parsers*, como o `digitP` (que deve ser capaz de fazer o parse de qualquer dÃ­gito) e *parsers* mais complexos como o para as `IntExpr` e para `Yaml`, mas resolve deixar alguns detalhes para depois. Como sempre, o "depois" chega, e vocÃª precisa completar o seu programa:

10. â˜…â˜†â˜† Implemente a instÃ¢ncia de `Functor` para `Parser`. Exemplos:
    ```hs
    > runParser digitP "102"
    ("02", 1)

    toBool x = if x=='0' then False else True
    outroParser = toBool <$> digitP -- lembrando que <$> Ã© a versÃ£o infixa do fmap

    > runParser outroParser "102"
    ("02", True)
    > runParser outroParser "002"
    ("02", False)
    ```

11. â˜…â˜…â˜† Implemente a instÃ¢ncia de `Applicative` para `Parser`. Exemplos:
    ```hs
    > :t (==) <$> digitP
    (==) <$> digitP :: Parser (Char -> Bool)

    > :t (==) <$> digitP <*> digitP
    (==) <$> digitP <*> digitP :: Parser Bool  -- consome dois dÃ­gitos e retorna se sÃ£o iguais

    > runParser ((==) <$> digitP <*> digitP) "11"
    Just ("",True)

    > runParser ((==) <$> digitP <*> digitP) "12"
    Just ("",False)

    > runParser ((==) <$> digitP <*> digitP) "1a"
    Nothing

    > runParser ((==) <$> digitP <*> digitP) "a1"
    Nothing

    > runParser ((==) <$> digitP <*> digitP) "aa"
    Nothing
    ```
12. â˜…â˜…â˜… Implemente a instÃ¢ncia de `Monad` para `Parser`. Exemplos:
    ```hs
    passwordP :: String -> Parser String
    passwordP user = stringP (getPassword user)
        where
            getPassword "ana" = "123" -- assuma que toda senha comeÃ§a com um nÃºmero
            getPassword "bob" = "456"
            -- ...

    > runParser alphaStringP "ana123"
    Just ("123","ana")
    > runParser (alphaStringP >>= passwordP) "ana123" -- faz o parse de um usuÃ¡rio e sua senha
    Just ("","123")                                   -- retornando a senha
    > runParser (alphaStringP >>= passwordP) "bob456"
    Just ("","456")
    > runParser (alphaStringP >>= passwordP) "ana456" -- e falha caso contrÃ¡rio
    Nothing
    ```

13. â˜…â˜…â˜… Implemente o *parser* `oneOrMoreP`, que recebe um Ãºnico *parser* e o executa pelo menos uma vez, mas o mÃ¡ximo de vezes que for possÃ­vel. VocÃª pode se inspirar no `firstOfP` para ter uma ideia de como implementar. Exemplos:
    ```hs
    > runParser (oneOrMoreP (charP 'a')) "a"
    Just ("","a")
    > runParser (oneOrMoreP (charP 'a')) "aaaa"
    Just ("","aaaa")
    > runParser (oneOrMoreP (charP 'a')) "aaaab"
    Just ("b","aaaa")
    > runParser (oneOrMoreP (charP 'a')) "ab"
    Just ("b","a")
    ```
14. â˜…â˜†â˜† Implemente o *parser* `optionalP`, que recebe um Ãºnico *parser* e o executa exatamente uma vez. Se for bem sucedido, retorna o resultado e consome a string. Caso contrÃ¡rio, retorna a string original, como se nÃ£o tivesse sido executado

    ```hs
    > runParser (optionalP (charP ' ')) "hello"
    Just ("hello",Nothing)
    > runParser (optionalP (charP ' ')) " hello"
    Just ("hello",Just ' ')
    ```
15. â˜…â˜…â˜† Implemente o *parser* `listOfBoolExprP`. A implementaÃ§Ã£o deve ser bastante semelhante ao `listOfIntExprP`, mas para `BoolExpr`. Veja os exemplos:
    ```hs
    > runParser listOfBoolExprP "1^0v1v0"
    Just ("",[BoolLit True,And,BoolLit False,Or,BoolLit True,Or,BoolLit False])
    > parse listOfBoolExprP "1^0v1v0" >>= evaluate
    Just (BoolLit True)
    ```


# OrientaÃ§Ãµes

> **ğŸ§™ It's dangerous to go alone! Take this.**
- Devido Ã  questÃ£o bÃ´nus, essa lista vale um total de 16 pontos, sendo possÃ­vel ficar com 16/10 na atividade ğŸ˜
- Consulte as funÃ§Ãµes jÃ¡ fornecidas em Definitions.hs, elas podem ser Ãºteis.
- Para outros exemplos, consulte tambÃ©m os *parsers* fornecidos na biblioteca
- Se o cÃ³digo nÃ£o compilar (incluindo erros na questÃ£o bÃ´nus) a lista inteira serÃ¡ zerada. Substitua exercÃ­cios incompletos por `undefined` antes de submeter.
- â˜¢ï¸ **NÃ£o altere** sob hipÃ³tese alguma o `Spec.hs`, `Eval.hs`, `Definitions.hs` ou o `Interpreter.hs` nem faÃ§a uso de bibliotecas externas. Esses arquivos, bem como todos os `.yaml` e `.cabal`, serÃ£o substituÃ­dos pelos originais na correÃ§Ã£o.
